 ![png](bookcore.png)

In [1]:
import pymysql
import pandas as pd
from urllib.parse import quote_plus as urlquote
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import VARCHAR, INTEGER

In [2]:
username = "root"
password = "root" 

connection = f"mysql+pymysql://{username}:{password}@localhost/bookscore"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [4]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_bookscore
0             authors
1               books
2           favorites
3               users

In [5]:
q = '''SELECT * FROM authors'''
pd.read_sql(q, conn)

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [6]:
authors = pd.read_csv('Data/authors.csv')
authors.head()
authors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [7]:
q = """DESCRIBE authors;"""
pd.read_sql(q,conn)

         Field         Type Null  Key Default           Extra
0           id          int   NO  PRI    None  auto_increment
1  author_name  varchar(45)  YES         None

In [8]:
#authors.to_sql("authors",conn,index=False, if_exists='append')

In [9]:
books = pd.read_csv('Data/books.csv')
books.head()
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [10]:
q = """DESCRIBE books;"""
pd.read_sql(q,conn)

       Field         Type Null  Key Default           Extra
0         id          int   NO  PRI    None  auto_increment
1      title  varchar(45)  YES         None
2  author_id          int   NO  PRI    None

In [11]:
#books.to_sql("books",conn,index=False, if_exists='append')

In [12]:
favorites = pd.read_csv('Data/favorites.csv')
favorites.head()
favorites.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

In [13]:
q = """DESCRIBE favorites;"""
pd.read_sql(q,conn)

     Field Type Null  Key Default Extra
0  user_id  int   NO  PRI    None
1  book_id  int   NO  PRI    None

In [14]:
#favorites.to_sql("favorites",conn,index=False, if_exists='append')

In [15]:
users = pd.read_csv('Data/users.csv')
users.head()
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

In [16]:
q = '''DESCRIBE users;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default           Extra
0          id          int   NO  PRI    None  auto_increment
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [17]:
#users.to_sql("users",conn,index=False, if_exists='append')

In [18]:
# i had to comment out these pieces of code since the data was inserted from the start

In [19]:
# Confirm the checks are deactiavated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q,conn)

   @@FOREIGN_KEY_CHECKS
0                     1

In [20]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, conn)

   @@FOREIGN_KEY_CHECKS
0                     1

In [21]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [22]:
# confirm the data has been added
q = """SELECT * FROM authors;"""
pd.read_sql(q,conn)

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [23]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John")); """
pd.read_sql(q,conn)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1